const { sleep } = require('../lib');

cmd({
    pattern: "hack",
    category: "prank",
    desc: "hacking prank",
    use: "<user>",
    filename: __filename,
});

handler.command = ['تهكير'];

async (Void, citel, text) => {
    // رسالة بداية التهكير
    citel.reply("```... جاري تهكير المستخدم```");

    // انتظار لمدة ثانية واحدة
    await sleep(1000);

    // رسالة توضح الاتصال بالخوادم
    citel.reply("```⌔: جاري الاتصال بالخوادم المتخصصة في التهكير```");

    // انتظار لمدة ثانية واحدة
    await sleep(1000);

    // رسالة توضح تحديد المستخدم للتهكير
    citel.reply("```⌔: تم تحديد المستخدم لتهكيره ✅```");

    // انتظار لمدة ثانية واحدة
    await sleep(1000);

    // تكرار عملية اختراق الضحية بنسب متزايدة حتى 100%
    for (let i = 0; i <= 100; i += 10) {
        // رسالة تظهر عملية اختراق الضحية بنسبة معينة
        citel.reply(`\`\`\`⪼ جـاري ... اختـراق الضـحيـة ${i}% ${'█'.repeat(i/10)}${'▒'.repeat((100-i)/10)}\`\`\``);

        // انتظار لمدة ثانية واحدة
        await sleep(1000);
    }

    // رسالة تظهر اكتمال العملية وبدء تحميل الملفات والبيانات
    citel.reply("```يتم تحميل الاختراق.. \n جاري رفع الملفات علي السيرفر...```");

    // انتظار لمدة ثانية واحدة
    await sleep(1000);

    // رسالة توضح الاتصال بجهاز الضحية وتحميل البيانات
    citel.reply("```تم الاتصال بجهاز الضحية... \n يتم تحميل البيانات...```");

    // انتظار لمدة ثانية واحدة
    await sleep(1000);

    // رسالة تظهر اكتمال عملية الاختراق
    citel.reply("```اختراق الضحية 100% اكتمل \n جاري جمع جميع الادله...```");

    // انتظار لمدة ثانية واحدة
    await sleep(1000);

    // رسالة تظهر نجاح الاختراق وحفظ بيانات الضحية
    citel.reply("```اكتمل الاختراق```");
    citel.reply("``` جاري حفظ بيانات الضحية...```");

    // انتظار لمدة ثانية واحدة
    await sleep(1000);

    // رسالة تظهر نجاح حفظ بيانات الضحية
    citel.reply("``` تم حفظ بيانات الضحية بنجاح```");

    // عودة رسالة نهائية توضح نجاح الاختراق وتهديد الضحية
    return citel.reply("🝳︙ تـم اخـتراق الضحـية بنجاح بـواسـطــــــه : الهاكر الجميل بدون تنازل قم بدفع المبلغ المطلوب وإلا سأقوم بنشر صورك");
});
