let handler = async (m, { command, text }) => m.reply(`*╔═╼─╾─╾═【🕸️】═╼─╾╾─╾═╗*
*رد تــلــقــائــي🧑🏻‍💻*
*╔⟐━───━┓🕸️┏━───━⟐╗*

*❆🎭┊الــلــقـب*
*〘〙*

*❆♟️┊مــن أنمي* 
*〘〙*

*❆⁉️┊بـنـت او ولـد*
*〘〙*

*❆🧭┊مـن طـرف* 
*〘〙*

*╚⟐━───━┛🕸️┗━───━⟐╝*
*❈↲لملئ الإستمارة يرجى النسخ وملء الفراغات*
*❈↲بعد ملئ الاستمارة منشن احد المشرفين*
*❈↲يرجى ارفاق صورة للقب*
*✦━━━━━━[ *𝑺𝐻𝐴𝐷𝛩𝑊 𝐵𝛩𝑇* ]━━━━━━✦`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(الاستماره|1|استماره\استمارة)$/i

export default handler
