let handler = async (m, { conn, command, text }) => {
let love = `
❆╼━━━━❆ •﹝👑﹞• ❆━━━━╾❆
*❮ اهلا بك في اوامـر بوت 'نسيانن١'🤖 ❯*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة المجموعات ❳ ⬳ ⌝🥏⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*❬👑❭↜ 〚.دحيح〛*
*〈البوت يجاوب عليك اذا كان عندك اي سؤال〉*

*❬👑❭↜ 〚.منشن〛*
*〈البوت يمنشن الجميع〉*

*❬👑❭↜ 〚.المشرفين〛*
*〈البوت يمنشن المشرفين〉*

*❬👑❭↜ 〚.مخفي〛*
*〈البوت يمنشن بطريقة وهمية〉*

*❬👑❭↜ 〚.طرد〛*
*〈البوت يطرد الي منشنته〉*

*❬👑❭↜ 〚.تغييرالترحيب〛*
*〈البوت يغير دخول شخص〉*

*❬👑❭↜ 〚.تغييرالمغادره〛*
*〈البوت يغير خروج شخص〉*

*❬👑❭↜ 〚.ترقية〛*
*〈البوت يرفع الي منشنته مشرف〉*

*❬👑❭↜ 〚.تخفيض〛*
*〈البوت ياخذ اشراف الي منشنته〉*

*❬👑❭↜ 〚.جروب〛*
*〈البوت يعطيك رابط الجروب〉*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة  التحـمـيل ❳ ⬳ ⌝📥⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*

*❬👑❭↜ 〚.فيسبوك〛*
*〈البوت يحمل لك الفيديو〉*

*❬👑❭↜ 〚.شغل〛*
*〈البوت رح يجيب حسب طلبك〉*

*❬👑❭↜ 〚.فيديو〛*
*〈البوت يجيب فيديو لطلبك〉*

*❬👑❭↜ 〚.البحث〛*
*〈البوت يبحث عن طلبك〉*

*❬👑❭↜ 〚.تيك〛*
*〈البوت يحمل فيديو التيك〉*

*❬👑❭↜ 〚.صوره〛*
*〈البوت يجب صورة لطلبك〉*

*❬👑❭↜ 〚.انستا〛*
*〈البوت يحمل رابط فيديو الانستا〉*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة الـتـرفـيـه ❳ ⬳ ⌝🎮⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*


*❬👑❭↜ 〚.اكس〛*
*〈البوت يفتح غرفة لعب جديدة〉*

*❬👑❭↜ 〚.سيمب〛*
*〈البوت يمنشن شخص عشوائي〉*

*❬👑❭↜ 〚.نسبة〛*
*〈البوت يحدد النسبة بحسب طلبك〉*

*❬👑❭↜ 〚.غباء〛*
*〈البوت يمنشن شخص عشوائي〉*

*❬👑❭↜ 〚.تحدث〛*
*〈البوت يحكي〉*

*❬👑❭↜ 〚.انطق〛*
*〈البوت ينطق طلبك〉*

*❬👑❭↜ 〚.لوغو〛*
*〈البوت يعطيك لوغو لطلبك〉*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة الـتحـويـل ❳ ⬳ ⌝🎴⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*

*❬👑❭↜ 〚.ملصق〛*
*〈البوت يحول صورة لملصق〉*

*❬👑❭↜ 〚.ستيكر〛*
*〈البوت يحول صورة لملصق〉*

*❬👑❭↜ 〚.سرقه〛*
*〈البوت يعطيك الملصق بحقوقك〉*

*❬👑❭↜ 〚.حيوان〛*
*〈البوت يعطيك ملصق حيوان〉*

*❬👑❭↜ 〚.ستكر〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستكر2〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستكر3〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستك〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستك2 •*
〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستك3〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستك4〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ترجم〛*
*〈البوت يترجم لغة معينة〉*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة الاعـضــاء ❳ ⬳ ⌝👥⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙

*❬👑❭↜ 〚.البروفايل〛*
*〈البوت يعطي معلوماتك〉*

*❬👑❭↜ 〚.المطور〛*
*〈البوت يعرض رقم المطور〉*

*❬👑❭↜ 〚.الدعم〛*
*〈البوت يعرض قروب دعم〉*

*❬👑❭↜ 〚.شرح〛*
*〈شرح اوامر البوت〉*

*❬👑❭↜ 〚.البوت〛*
*〈معلومات عن البوت〉*

*❬👑❭↜ 〚.طقم〛*
*〈البوت يعطيك تطقيم〉*

❆╼━━━━❆ •﹝👑﹞• ❆━━━━╾❆

*❬👑❭↜ 〚.قروبي واتساب 〛*


https://chat.whatsapp.com/GlHhQPiYbF95GfsoecQByb
❆╼━━━━❆ •﹝👑﹞• ❆━━━━╾❆

 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(شرح|الشرح)$/i
export default handler
